
export const FETCHING_STATUS = {
  IDLE: 0,
  FETCHING: 1,
  DONE: 2,
  ERROR: 3
}

export const departmentList = [
  '資訊工程學系',
  '奈米科學及工程學士學位學程',
  '理學院科學學士學位學程',
  '電機資訊學士班',
  '電子工程學系',
  '機械工程學系',
  '土木工程學系',
  '材料科學與工程學系',
  '電子物理學系',
  '應用數學系',
  '電機工程學系',
  '光電工程學系',
  '應用化學系',
  '生物科技學系',
  '管理科學系',
  '運輸與物流管理學系',
  '工業工程與管理學系',
  '百川學士學位學程',
  '外國語文學系',
  '資訊管理與財務金融學系',
  '人文社會學系',
  '傳播與科技學系',
  '系統工程與科技學士學位學程'
]

export const MAIL_CONTENT = [
  "同學要在dino申請",
  "同學要去選課",
  "教授要評分",
  "教授要審核專題"
]